# Country Comparisons
from factbook

## Conection to DATABASE

In [11]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

## Overview of the Data

What TABLES are in DATABASE

In [17]:
%%sql
SELECT 
    *
FROM 
    sqlite_master
WHERE 
    type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

What the data in the facts TABLE look like

In [18]:
%%sql 
SELECT 
    *
FROM 
    facts
LIMIT 
    5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Descriptions for some of the columns:

- name — the name of the country.

- area— the country's total area (both land and water).

- area_land — the country's land area in square kilometers.

- area_water — the country's waterarea in square kilometers.

- population — the country's population.

- population_growth— the country's population growth as a percentage.

- birth_rate — the country's birth rate, or the number of births per year per 1,000 people.

- death_rate — the country's death rate, or the number of death per year per 1,000 people.

# Summary statistics

- Minimum population

- Maximum population

- Minimum population growth

- Maximum population growth

In [20]:
%%sql

SELECT
    MIN(population) AS min_pop
    ,MAX(population) AS max_pop
    ,MIN(population_growth) AS min_pop_growth
    ,MAX(population_growth) AS max_pop_growth
FROM
    facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

Countries with minimum population

In [32]:
%%sql 

SELECT
    *
FROM
    facts
WHERE population == (SELECT
                        MIN(population)
                    FROM
                        facts
                    );

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

Countries with maximum population

In [33]:
%%sql 

SELECT
    *
FROM
    facts
WHERE population == (SELECT
                        MAX(population)
                    FROM
                        facts
                    );

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

Without World and Antarctica:

- Minimum population

- Maximum population

- Minimum population growth

- Maximum population growth

In [39]:
%%sql

SELECT
    MIN(population) AS min_pop
    ,MAX(population) AS max_pop
    ,MIN(population_growth) AS min_pop_growth
    ,MAX(population_growth) AS max_pop_growth
FROM
    facts
WHERE 
    name NOT IN ('World', 'Antarctica');

 * sqlite:///factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

AVG average value for:

- population
    
- area

In [42]:
%%sql

SELECT
    ROUND(AVG(population),3) AS avg_population
    ,ROUND(AVG(area),3) AS avg_area
FROM
    facts
WHERE 
    name NOT IN ('World', 'Antarctica');

 * sqlite:///factbook.db
Done.

[(32377011.013, 555093.546)]

Countries with population above average.

Countries with area below average.

In [43]:
%%sql

SELECT
    *
FROM
    facts
WHERE 
    population > (
                    SELECT
                        AVG(population)
                    FROM
                        facts
                    WHERE 
                        name NOT IN ('World', 'Antarctica')
                )
AND
    area < (
                    SELECT
                        AVG(area)
                    FROM
                        facts
                    WHERE 
                        name NOT IN ('World', 'Antarctica')
                );

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]

Which country has the most people?

In [45]:
%%sql

SELECT
    name
    ,MAX(population) AS max_pop
FROM
    facts
WHERE 
    name <> 'World';

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

Which country has the highest growth rate?

In [46]:
%%sql

SELECT
    name
    ,MAX(population_growth) AS max_pop_growth
FROM
    facts
WHERE 
    name <> 'World';

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

Which countries have the highest ratios of water to land?

In [61]:
%%sql

SELECT
    *
    ,CAST(area_water AS Float) / area_land AS ratio_water_land
FROM
    facts
ORDER BY
    ratio_water_land DESC
LIMIT
    10;

 * sqlite:///factbook.db
Done.

[(228, 'io', 'British Indian Ocean Territory', 54400, 60, 54340, None, None, None, None, None, 905.6666666666666),
 (247, 'vq', 'Virgin Islands', 1910, 346, 1564, 103574, 0.59, 10.31, 8.54, 7.67, 4.520231213872832),
 (246, 'rq', 'Puerto Rico', 13791, 8870, 4921, 3598357, 0.6, 10.86, 8.67, 8.15, 0.5547914317925592),
 (12, 'bf', 'Bahamas, The', 13880, 10010, 3870, 324597, 0.85, 15.5, 7.05, 0.0, 0.3866133866133866),
 (71, 'pu', 'Guinea-Bissau', 36125, 28120, 8005, 1726170, 1.91, 33.38, 14.33, 0.0, 0.2846728307254623),
 (106, 'mi', 'Malawi', 118484, 94080, 24404, 17964697, 3.32, 41.56, 8.41, 0.0, 0.25939625850340137),
 (125, 'nl', 'Netherlands', 41543, 33893, 7650, 16947904, 0.41, 10.83, 8.66, 1.95, 0.22571032366565366),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74, 0.22292237442922375),
 (56, 'er', 'Eritrea', 117600, 101000, 16600, 6527689, 2.25, 30.0, 7.52, 0.0, 0.16435643564356436),
 (99, 'li', 'Liberia', 111369, 96320, 15049, 4195666, 2.47, 34.41, 9.69, 0.0, 0.15623961794019933)]

Which countries have more water than land?

In [62]:
%%sql

SELECT
    *
FROM
    facts
WHERE
    area_water > area_land;

 * sqlite:///factbook.db
Done.

[(228, 'io', 'British Indian Ocean Territory', 54400, 60, 54340, None, None, None, None, None),
 (247, 'vq', 'Virgin Islands', 1910, 346, 1564, 103574, 0.59, 10.31, 8.54, 7.67)]

Which countries will add the most people to their populations next year?

In [66]:
%%sql

SELECT
    *
    ,birth_rate * population / 1000 AS add_people
FROM
    facts
ORDER BY
    add_people DESC
LIMIT
    15;

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None, 134970714.2046),
 (77, 'in', 'India', 3287263, 2973193, 314070, 1251695584, 1.22, 19.55, 7.32, 0.04, 24470648.6672),
 (37, 'ch', 'China', 9596960, 9326410, 270550, 1367485388, 0.45, 12.49, 7.53, 0.44, 17079892.496120002),
 (129, 'ni', 'Nigeria', 923768, 910768, 13000, 181562056, 2.45, 37.64, 12.9, 0.22, 6833995.78784),
 (197, 'ee', 'European Union', 4324782, None, None, 513949445, 0.25, 10.2, 10.2, 2.5, 5242284.339),
 (132, 'pk', 'Pakistan', 796095, 770875, 25220, 199085847, 1.46, 22.58, 6.49, 1.54, 4495358.425259999),
 (78, 'id', 'Indonesia', 1904569, 1811569, 93000, 255993674, 0.92, 16.72, 6.37, 1.16, 4280214.22928),
 (186, 'us', 'United States', 9826675, 9161966, 664709, 321368864, 0.78, 12.49, 8.15, 3.86, 4013897.11136),
 (58, 'et', 'Ethiopia', 1104300, None, 104300, 99465819, 2.89, 37.27, 8.19, 0.22, 3707091.07413),
 (14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46, 3571766.7293000002),
 (24, 'br', 'Brazil', 8515770, 8358140, 157630, 204259812, 0.77, 14.46, 6.58, 0.14, 2953596.88152),
 (40, 'cg', 'Congo, Democratic Republic of the', 2344858, 2267048, 77810, 79375136, 2.45, 34.88, 10.07, 0.27, 2768604.7436800003),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09, 2451230.58552),
 (114, 'mx', 'Mexico', 1964375, 1943945, 20430, 121736809, 1.18, 18.78, 5.26, 1.68, 2286217.27302),
 (53, 'eg', 'Egypt', 1001450, 995450, 6000, 88487396, 1.79, 22.9, 4.77, 0.19, 2026361.3683999998)]